In [15]:
from src.helper import load_pickle, dump_pickle
from sklearn.model_selection import train_test_split

In [6]:
dataset = load_pickle("data/processed/sample_raw_dataset.pkl")
dataset

        SK_ID_CURR NAME_CONTRACT_TYPE  ... AMT_GOODS_PRICE TARGET
140         100162         Cash loans  ...        472500.0      0
334         100383         Cash loans  ...        450000.0      0
374         100431         Cash loans  ...       1350000.0      0
393         100456         Cash loans  ...        450000.0      0
432         100499         Cash loans  ...        540000.0      0
...            ...                ...  ...             ...    ...
306923      455594         Cash loans  ...        675000.0      0
306945      455617         Cash loans  ...        958500.0      0
307062      455747         Cash loans  ...        598500.0      0
307116      455812         Cash loans  ...        143977.5      0
307181      455884         Cash loans  ...        135000.0      0

[2000 rows x 9 columns]

#### Check data type

In [9]:
dataset.dtypes

SK_ID_CURR              int64
NAME_CONTRACT_TYPE     object
CODE_GENDER            object
FLAG_OWN_CAR           object
AMT_INCOME_TOTAL      float64
AMT_CREDIT            float64
AMT_ANNUITY           float64
AMT_GOODS_PRICE       float64
TARGET                  int64
dtype: object

#### Check data range

In [11]:
dataset.describe()

          SK_ID_CURR  AMT_INCOME_TOTAL  ...  AMT_GOODS_PRICE       TARGET
count    2000.000000      2.000000e+03  ...     2.000000e+03  2000.000000
mean   278156.476000      1.678178e+05  ...     5.408356e+05     0.080000
std    102624.397556      9.213854e+04  ...     3.759740e+05     0.271361
min    100162.000000      3.060000e+04  ...     4.500000e+04     0.000000
25%    189761.250000      1.125000e+05  ...     2.340000e+05     0.000000
50%    278985.000000      1.476360e+05  ...     4.500000e+05     0.000000
75%    366597.250000      2.025000e+05  ...     6.795000e+05     0.000000
max    455884.000000      1.215000e+06  ...     2.250000e+06     1.000000

[8 rows x 6 columns]

#### Check data shape

In [13]:
dataset.shape

(2000, 9)

#### Check missing values

In [14]:
dataset.isnull().sum()

SK_ID_CURR            0
NAME_CONTRACT_TYPE    0
CODE_GENDER           0
FLAG_OWN_CAR          0
AMT_INCOME_TOTAL      0
AMT_CREDIT            0
AMT_ANNUITY           0
AMT_GOODS_PRICE       0
TARGET                0
dtype: int64

#### Data splitting

In [17]:
X = dataset.drop(["TARGET"], axis = 1).copy()
y = dataset["TARGET"].copy()

In [19]:
X.head()

     SK_ID_CURR NAME_CONTRACT_TYPE  ... AMT_ANNUITY AMT_GOODS_PRICE
140      100162         Cash loans  ...     18216.0        472500.0
334      100383         Cash loans  ...     20929.5        450000.0
374      100431         Cash loans  ...     47542.5       1350000.0
393      100456         Cash loans  ...     26640.0        450000.0
432      100499         Cash loans  ...     36963.0        540000.0

[5 rows x 8 columns]

In [21]:
y.value_counts()

0    1840
1     160
Name: TARGET, dtype: int64

In [22]:
X_train, X_test, y_train, y_test = train_test_split(X, y,
                                                    test_size = 0.2,
                                                    random_state = 42,
                                                    stratify = y)

In [25]:
X_train.shape, y_train.shape

((1600, 8), (1600,))

In [26]:
X_test.shape, y_test.shape

((400, 8), (400,))

In [27]:
dump_pickle(X_train, "data/processed/X_train.pkl")
dump_pickle(y_train, "data/processed/y_train.pkl")
dump_pickle(X_test, "data/processed/X_test.pkl")
dump_pickle(y_test, "data/processed/y_test.pkl")

In [28]:
load_pickle("data/processed/X_train.pkl")

        SK_ID_CURR NAME_CONTRACT_TYPE  ... AMT_ANNUITY AMT_GOODS_PRICE
185640      315203         Cash loans  ...     28984.5        477000.0
266989      409335         Cash loans  ...     18135.0        135000.0
37682       143649         Cash loans  ...     21546.0        540000.0
280087      424501         Cash loans  ...     37255.5       1350000.0
255967      396187         Cash loans  ...     37777.5        373500.0
...            ...                ...  ...         ...             ...
206264      339077         Cash loans  ...     22099.5        405000.0
123969      243760         Cash loans  ...     37669.5       1125000.0
116922      235582         Cash loans  ...     14013.0        117000.0
118218      237081         Cash loans  ...     47952.0        900000.0
263659      405272         Cash loans  ...     14377.5        225000.0

[1600 rows x 8 columns]